Repository: aacurtis/arcade_book
Catalog: locale/*/LC_MESSAGES/chapters/25_array_backed_grids/array_backed_grids.po
Languages: de

source: Array-Backed Grids
de: Array-basierte Gitterraster

source: Introduction
de: Einführung

source: Games like minesweeper, tic-tac-toe, and many types of adventure games keep data for the game in a grid of numbers. For example, a tic-tac-toe board:
de: Spiele wie Minesweeper, Tic-Tac-Toe und viele Arten von Adventures speichern die Daten für das Spiel in einem Zahlenraster. Zum Beispiel ein Tic-Tac-Toe-Brett:

source: . . . can use a grid of numbers to represent the empty spots, the O's and the X's like this:
de: . . . kann ein Zahlengitter verwenden, um die leeren Punkte, die O und die X wie folgt darzustellen:

source: This grid of numbers can also be called a *two-dimensional* array or a *matrix*. (Finally, we get to learn about The Matrix.) The values of the numbers in the grid represent what should be displayed at each board location. In the prior example, 0 represents a spot where no one has played, a 1 represents an X, and a 2 represents an O.
de: Dieses Zahlenraster kann auch als *zweidimensionales* Array oder *Matrix* bezeichnet werden. (Endlich lernen wir Die Matrix kennen.) Die Werte der Zahlen im Raster geben an, was an jeder Position des Spielfelds angezeigt werden soll. Im vorherigen Beispiel steht 0 für eine Stelle, an der noch niemand gespielt hat, eine 1 für ein X und eine 2 für ein O.

source: Figure 16.1: Minesweeper game, showing the backing grid of numbers
de: Abbildung 16.1: Minesweeper-Spiel mit dem dahinterstehenden Zahlengitter

source: The figure above is an example from the classic minesweeper game. This example has been modified to show both the classic display on the left, and the grid of numbers used to display the board on the right.
de: Die obige Abbildung ist ein Beispiel aus dem klassischen Minesweeper-Spiel. Dieses Beispiel wurde geändert, um sowohl die klassische Anzeige auf der linken Seite als auch das Zahlenraster für die Anzeige des Spielfelds auf der rechten Seite anzuzeigen.

source: The number ``10`` represents a mine, the number ``0`` represents a space that has not been clicked, and the number 9 represents a cleared space. The numbers ``1`` to ``8`` represent how many mines are within the surrounding eight squares, and is only filled in when the user clicks on the square.
de: Die Zahl ``10`` steht für eine Mine, die Zahl ``0`` für ein nicht angeklicktes Feld und die Zahl ``9`` für ein gelöschtes Feld. Die Zahlen ``1`` bis ``8`` geben an, wie viele Minen sich in den umliegenden acht Feldern befinden, und werden nur dann ausgefüllt, wenn der Benutzer auf das Feld klickt.

source: Minesweeper can actually have two grids. One for the regular display, and a completely separate grid of numbers that will track if the user has placed "flags" on the board marking where she thinks the mines are.
de: Minesweeper kann eigentlich zwei Gitter haben. Eine für die reguläre Anzeige und ein vollständig getrenntes Zahlenraster, das nachverfolgt, ob der Benutzer "Flaggen" auf die Tafelmarkierung gesetzt hat, an der er denkt, dass sich die Minen befinden.

source: Classic adventure game maps are created using a tiled map editor. These are huge grids where each location is simply a number representing the type of terrain that goes there. The terrain could be things like dirt, a road, a path, green grass, brown grass, and so forth. Programs like Tiled_ shown in the figure below allow a developer to easily make these maps and write the grid to disk.
de: Klassische Adventure Maps werden mit einem auf Kacheln basierenden Karteneditor erstellt. Dies sind riesige Gitter, in denen jeder Ort einfach eine Zahl ist, die den Geländetyp darstellt, der dorthin gehört. Das Gelände könnte aus Sand, einer Straße, einem Pfad, grünem Gras, braunem Gras und so weiter bestehen. Mit Programmen wie Tiled_, das in der folgenden Abbildung gezeigt werden, kann ein Entwickler diese Karten auf einfache Weise erstellen und das Raster auf die Festplatte schreiben.

source: Adventure games also use multiple grids of numbers, just like minesweeper has a grid for the mines, and a separate grid for the flags. One grid, or "layer," in the adventure game represents terrain you can walk on; another for things you can't walk on like walls and trees; a layer for things that can instantly kill you, like lava or bottomless pits; one for objects that can be picked up and moved around; and yet another layer for initial placement of monsters.
de: In Adventures werden auch mehrere Zahlenraster verwendet, genau wie bei Minesweeper ein Raster für die Minen und ein separates Raster für die Flaggen. Ein Raster oder "Layer" im Adventure steht für begehbares Gelände. Ein anderes für Dinge, auf denen man nicht laufen kann wie Mauern und Bäume. Ein Layer für Dinge, die dich sofort töten können, wie Lava oder bodenlose Gruben. Einer für Gegenstände, die aufgenommen und bewegt werden können und noch eine Ebene für die Anfangspositionen von Monstern.

source: Application
de: Anwendung

source: Enough talk, let's write some code. This example will create a grid that will trigger if we display a white or green block. We can change the grid value and make it green by clicking on it. This is a first step to a grid-based game like minesweeper, battleship, connect four, etc. (One year I had a student call me over and she had modified a program like this to show my name in flashing lights. That was . . . disturbing. So please use this knowledge only for good!)
de: Genug geredet, schreiben wir etwas Code. In diesem Beispiel wird ein Raster erstellt, das auslösen wird, ob ein weißer oder grüner Block angezeigt wird. Wir können den Rasterwert ändern und ihn grün machen, indem wir darauf klicken. Dies ist ein erster Schritt zu einem rasterbasierten Spiel wie Minesweeper, Schiffe versenken, Vier gewinnt und so weiter. (In einem Schuljahr wurde ich von einer Studierenden an ihren Rechner gerufen. Sie hatte ein Programm wie dieses so modifiziert, dass mein Name in blinkenden Feldern angezeigt wurde. Das war . . . beunruhigend. Bitte nutze dieses Wissen nur zum Guten!)

source: Start with this template:
de: Beginnen wir mit dieser Vorlage:

source: Starting with the file above, attempt to recreate this program following the instructions here. The final program is at the end of this chapter but don't skip ahead and copy it! If you do that you'll have learned nothing. Anyone can copy and paste the code, but if you can recreate this program you have skills people are willing to pay for. If you can only copy and paste, you've wasted your time here.
de: Beginne mit der obigen Datei und versuche, dieses Programm neu zu erstellen, indem Sie den Anweisungen hier folgen. Das endgültige Programm befindet sich am Ende dieses Kapitels, aber springe nicht direkt dahin und kopiere es! Wenn du das tust, hast du nichts gelernt. Jeder kann den Code kopieren und einfügen, aber wenn du dieses Programm neu erstellen kannst, verfügst du über Fähigkeiten, für die die Leute bereit sind, zu bezahlen. Wenn du nur kopieren und einfügen kannst, hast du hier deine Zeit verschwendet.

source: Drawing the Grid
de: Raster zeichnen

source: Create variables named ``WIDTH``, ``HEIGHT``, and ``MARGIN``. Set the width and height to 20. This will represent how large each grid location is. Set the margin to 5. This represents the margin between each grid location and the edges of the screen. Create these variables at the top of the program, after the ``import`` statements. Also create variables ``ROW_COUNT`` and ``COLUMN_COUNT``. Set them to 10. This will control how many rows and columns we will have.
de: Erstelle Variablen mit den Namen ``WIDTH``, ``HEIGHT`` und ``MARGIN``. Stelle die Breite und Höhe auf 20 ein. Dies gibt an, wie groß die einzelnen Rasterpositionen sind. Setze den ``MARGIN`` auf 5. Dies stellt den Rand zwischen den einzelnen Rasterpositionen und den Rändern des Bildschirms dar. Erstelle diese Variablen oben im Programm nach den ``import``-Anweisungen. Erstelle auch die Variablen ``ROW_COUNT`` und ``COLUMN_COUNT``. Stelle sie auf 10 ein. Dadurch wird gesteuert, wie viele Zeilen und Spalten wir haben werden.

source: Calculate ``SCREEN_WIDTH`` and ``SCREEN_HEIGHT`` based on the variables we created above. If we have 10 rows, and each row is 20 high, that's 200 pixels. If we have 10 rows, that's also 11 margins. (Nine between the cells and two on each edge.) That is 55 more pixels for a total of 255. Write the equation so it works with whatever we select in the constants created by step 1.
de: Berechne ``SCREEN_WIDTH`` und ``SCREEN_HEIGHT`` basierend auf den oben erstellten Variablen. Wenn wir 10 Zeilen haben und jede Zeile 20 hoch ist, sind das 200 Pixel. Wenn wir 10 Zeilen haben, sind das auch 11 Ränder. (Neun zwischen den Zellen und zwei an jeder Kante.) Das sind 55 weitere Pixel für insgesamt 255. Schreibe die Gleichung so, dass sie mit allen in Schritt 1 erstellten Konstanten funktioniert.

source: Change the background to black. Draw a white box in the lower-left corner. Draw the box drawn using the height and width variables created earlier. (Feel free to adjust the colors.) Use the `draw_rect_filled`_ function. You will need to center the rectangle not at (0, 0) but at a coordinate that takes into account the height and width of the rectangle, such as :math:`\frac{width}{2}`. When you get done your program's window should look like:
de: Ändere den Hintergrund in Schwarz. Zeichne ein weißes Kästchen in die linke untere Ecke. Zeichne das gezeichnete Feld mit den zuvor erstellten Höhen- und Breitenvariablen. (Wenn du magst kannst du die Farben ändern.) Verwende die Funktion `draw_rect_filled`_. Du solltest das Rechteck nicht auf (0, 0) zentrieren, sondern auf eine Koordinate, die die Höhe und Breite des Rechtecks ​​berücksichtigt, zum Beispiel :math:`\frac{width}{2}`. Wenn du fertig bist, sollte das Fenster deines Programms so aussehen:

source: Figure 16.3: Step 3
de: Abbildung 16.3: Schritt 3

source: Use a ``for`` loop to draw ``COLUMN_COUNT`` boxes in a row. Use ``column`` for the variable name in the ``for`` loop. The output will look like one long box until we add in the margin between boxes. See Figure 16.4.
de: Verwende eine ``for``-Schleife, um ``COLUMN_COUNT`` Kästchen in einer Reihe zu zeichnen. Verwende ``column`` für den Variablennamen in der ``for``-Schleife. Die Ausgabe sieht aus wie eine lange Box, bis der Rand zwischen den Boxen hinzugefügt wird. Siehe Abbildung 16.4.

source: Figure 16.4: Step 4
de: Abbildung 16.4: Schritt 4

source: Adjust the drawing of the rectangle to add in the ``MARGIN`` variable. Now there should be gaps between the rectangles. See Figure 16.5.
de: Passe die Zeichnung des Rechtecks ​​an, um die Variable ``MARGIN`` hinzuzufügen. Jetzt sollte es Lücken zwischen den Rechtecken geben. Siehe Abbildung 16.5.

source: Figure 16.5: Step 5
de: Abbildung 16.5: Schritt 5

source: Add the margin before drawing the rectangles, in addition to between each rectangle. This should keep the box from appearing right next to the window edge. See Figure 16.6. You'll end up with an equation like: :math:`(margin+width)\cdot column+margin+\frac{width}{2}`
de: Füge den Rand hinzu, bevor du die Rechtecke zeichnest, zusätzlich zu jedem Rechteck. Dies sollte verhindern, dass das Kästchen direkt neben der Fensterkante angezeigt wird. Siehe Abbildung 16.6. Am Ende erhälst du eine Gleichung wie: :math:`(Rand + Breite)\cdot Spalte + Rand + \frac{Rand}{2}`

source: Figure 16.6: Step 6
de: Abbildung 16.6: Schritt 6

source: Add another ``for`` loop that also will loop for each row. Call the variable in this ``for`` loop ``row``. Now we should have a full grid of boxes. See Figure 16.7.
de: Füge eine weitere ``for``-Schleife, die durch die Zeilen iteriert, hinzu. Nenne die Variable in dieser ``for``-Schleife ``row``. Jetzt sollten wir ein vollständiges Raster von Kisten haben. Siehe Abbildung 16.7.

source: Figure 16.7: Step 7
de: Abbildung 16.7: Schritt 7

source: Populating the Grid
de: Auffüllen des Rasters

source: Now we need to create a two-dimensional array. We need to create this once, at program start-up. So this will go in the program's ``__init__`` method. Creating a two-dimensional array in Python is, unfortunately, not as easy as it is in some other computer languages. There are some libraries that can be downloaded for Python that make it easy (like numpy), but for this example they will not be used. To create a two-dimensional array and set an example, use the code below:
de: Jetzt müssen wir ein zweidimensionales Array erstellen. Wir müssen dies einmal beim Programmstart erstellen. Das geht also in die ``__init__``-Methode des Programms. Das Erstellen eines zweidimensionalen Arrays in Python ist leider nicht so einfach wie in einigen anderen Computersprachen. Es gibt einige Bibliotheken, die für Python heruntergeladen werden können, um das zu vereinfachen (zum Beispiel numpy), aber für dieses Beispiel werden sie nicht verwendet. Verwende den folgenden Code, um ein zweidimensionales Array zu erstellen als ein Beispiel:

source: Create a 10x10 array of numbers
de: Erstelle ein 10x10-Array von Zahlen

source: A much shorter example is below, but this example uses some odd parts of Python that I don't bother to explain in this book:
de: Ein viel kürzeres Beispiel findest du weiter unten, aber in diesem Beispiel werden einige merkwürdige Teile von Python verwendet, die ich in diesem Buch nicht näher erläutere:

source: Use one of these two examples and place the code to create our array ahead of your main program loop.
de: Verwende eines dieser beiden Beispiele und platziere den Code vor deiner Hauptprogrammschleife, um unser Array zu erstellen.

source: Set an example location in the array to 1.
de: Setze einen beispielhaften Ort im Array auf 1.

source: Two dimensional arrays are usually represented addressed by first their row, and then the column. This is called a row-major storage. Most languages use row-major storage, with the exception of Fortran and MATLAB. Fortran and MATLAB use column-major storage.
de: Zweidimensionale Arrays werden normalerweise dargestellt, indem zuerst ihre Zeile und dann die Spalte adressiert werden. Dies wird als zeilendominiert bezeichnet. Die meisten Sprachen, mit Ausnahme von Fortran und MATLAB, verwenden zeilendominierte Speicherung. Fortran und MATLAB verwenden Spaltendominanz.

source: Place this code somewhere ahead of your main program loop.
de: Platziere diesen Code irgendwo vor der Hauptprogrammschleife.

source: Select the color of the rectangle based on the value of a variable named ``color``. Do this by first finding the line of code where the rectangle is drawn. Ahead of it, create a variable named ``color`` and set it equal to white. Then replace the white color in the rectangle declaration with the ``color`` variable.
de: Wähle die Farbe des Rechtecks ​​basierend auf dem Wert einer Variablen namens ``color``. Suche dazu zuerst die Codezeile, in der das Rechteck gezeichnet wird. Erstelle davor eine Variable mit dem Namen ``color`` und setze sie auf ``white``. Ersetze dann die weiße Farbe in der Rechteckdeklaration durch die Variable ``color``.

source: Select the color based on the value in the grid. After setting color to white, place an if statement that looks at the value in ``grid[row][column]`` and changes the color to green if the grid value is equal to 1. There should now be one green square. See Figure 16.8.
de: Wähle die Farbe basierend auf dem Wert im Raster. Nachdem du die Farbe auf Weiß gesetzt haben, platziere eine ``if``-Anweisung, die den Wert in ``grid[row][column]`` betrachtet und die Farbe in grün ändert, wenn der Rasterwert gleich 1 ist. Es sollte jetzt ein grünes Quadrat geben. Siehe Abbildung 16.8.

source: Figure 16.8: Step 11
de: Abbildung 16.8: Schritt 11

source: Print "click" to the screen if the user clicks the mouse button. See :ref:`mouse-click` if you've forgotten how to do that.
de: Gebe "klick" auf dem Bildschirm aus, wenn der Benutzer mit der Maustaste klickt. Siehe :ref:`mouse-click`, wenn du vergessen hast, wie das geht.

source: Print the mouse coordinates when the user clicks the mouse.
de: Gib die Mauskoordinaten aus, wenn der Benutzer mit der Maus klickt.

source: Convert the mouse coordinates into grid coordinates. Print those instead. Remember to use the width and height of each grid location combined with the margin. It will be necessary to convert the final value to an integer. This can be done by using int or by using the integer division operator ``//`` instead of the normal division operator ``/``. See Figure 16.9.
de: Konvertiere die Mauskoordinaten in Rasterkoordinaten. Gebe diese stattdessen aus. Denke daran, die Breite und Höhe jeder Rasterposition in Kombination mit dem Rand zu verwenden. Es ist notwendig, den Endwert in eine Ganzzahl umzuwandeln. Dies kann durch Verwendung von ``int`` oder durch Verwendung des Integer-Divisionsoperators ``//`` anstelle des normalen Divisionsoperators ``/`` erfolgen. Siehe Abbildung 16.9.

source: Figure 16.9: Step 14
de: Abbildung 16.9: Schritt 14

source: Set the grid location at the row/column clicked to 1. See Figure 16.10.
de: Setze die Rasterposition, auf die geklickt wurde, auf 1. Siehe Abbildung 16.10.

source: Figure 16.10: Step 15
de: Abbildung 16.10: Schritt 15
