Repository: aacurtis/arcade_book
Catalog: locale/*/LC_MESSAGES/labs/lab_05_loopy_lab/loopy_lab.po
Languages: de

source: Lab 5: Loopy Lab
de: Übung 5: Loopy Lab

source: The goal of this lab is to practice using nested ``for`` loops. We will create a program that makes the following image:
de: Das Ziel dieser Übung ist es, die Verwendung von verschachtelten ``for``-Schleifen zu üben. Wir werden ein Programm erstellen, das folgendes Bild erzeugt:

source: For sanity's sake, let's give a number to each section. Then when we ask questions we can say which section we are talking about. Do **not** put the numbers in the final program. Here are the section numbers:
de: Geben wir, damit wir nicht verrückt werden, jedem Abschnitt eine Nummer. Wenn wir dann Fragen stellen, können wir sagen, um welchen Abschnitt es sich handelt. Gebe die Zahlen **nicht** in das endgültige Programm ein. Hier sind die Abschnittsnummern:

source: Great! All these items can be created using nested ``for`` loops.
de: Großartig! Alle diese Elemente können mit verschachtelten ``for``-Schleifen erstellt werden.

source: Getting Started
de: Los geht's

source: Below is some code to get you started. Underneath each of the comments, fill in the code required to make the pattern.
de: Nachfolgend findest du ein Programm, mit dem du anfangen kannst. Gebe unter jedem Kommentar den Code ein, der für die Erstellung des Musters erforderlich ist.

source: Scoring
de: Bewertung

source: There are 20 possible points:
de: Es gibt 20 mögliche Punkte:

source: Section 1: 2 pts
de: Abschnitt 1: 2 Punkte

source: Section 2: 2 pts
de: Abschnitt 2: 2 Punkte

source: Section 3: 2 pts
de: Abschnitt 3: 2 Punkte

source: Section 4: 2 pts
de: Abschnitt 4: 2 Punkte

source: Completing any section 1-4: 1 pt
de: Komplett lösen eines Abschnitts von 1 bis 4: 1 Punkt

source: Section 5: 2 pts
de: Abschnitt 5: 2 Punkte

source: Section 6: 2 pts
de: Abschnitt 6: 2 Punkte

source: Section 7: 2 pts
de: Abschnitt 7: 2 Punkte

source: Section 8: 2 pts
de: Abschnitt 8: 2 Punkte

source: Completing any section 5-8: 1 pt
de: Komplett lösen eines Abschnitts von 5 bis 8: 1 Punkt

source: Code Style: 2 pts (Should have no yellow lines on right side of PyCharm)
de: Coding-Stil: 2 Punkte (In PyCharm sollten keine gelben Linien auf der rechten Seite angezeigt werden)

source: Hints
de: Hinweise

source: Each little square is a 5x5 pixel square.
de: Jedes kleine Quadrat ist ein Quadrat mit 5x5 Pixeln.

source: If the center of each square is 5 apart, you won't see an edge and it will look like one big square.
de: Wenn die Mitten der Quadrate 5 Pixel voneinander entfernt sieht, sieht man keine Kante und es sieht aus wie ein großes Quadrat.

source: Remember, row controls up and down, so it corresponds to y. Column corresponds to x.
de: Denke daran, die Zeile (oben und unten) entspricht y, die Spalte entspricht x.

source: When working on sections 2-8, you can simple add to the x and/or y values to shift everything over. For example, just add 300 to all the x values in section 2, to put it in the second box.
de: Wenn du an den Abschnitten 2-8 arbeitest, kannst du einfach die x- und/oder y-Werte hinzufügen, um alles zu verschieben. Zum Beispiel addieren Sie einfach 300 zu allen x-Werten in Abschnitt 2, um sie in das zweite Feld einzufügen.

source: Each section is 300x300 pixels.
de: Jeder Abschnitt hat eine Größe von 300x300 Pixel.

source: You will only need two ``for`` loops. Do not use a third nested ``for`` loop.
de: Du benötigst nur zwei ``for``-Schleifen. Verwende keine dritte verschachtelte ``for``-Schleife.

source: Section 4 only needs one ``if`` statement. The trick is to use an ``and``.
de: Abschnitt 4 benötigt nur eine ``if``-Anweisung. Der Trick besteht darin, ein ``and`` zu verwenden.

source: Remember that the ``%`` sign is the modulus. It calculates the remainder. So::
de: Denke daran, dass das Zeichen ``%`` der Modulo-Operator ist. Er berechnet den Rest. So:

source: You can count "backwards" by subtracting.
de: Du kannst "rückwärts" zählen, indem du subtrahierst.

source: This prints::
de: Dies gibt aus:
